Autodesk.Navisworks.Api.Hyperlink
Represents a hyperlink attached to a ModelItem.

Autodesk.Navisworks.Api.Hyperlink.#ctor(System.String,System.String)
Creates a new hyperlink.
name: Hyperlink name.
url: Hyperlink URL.

Autodesk.Navisworks.Api.Hyperlink.#ctor(System.String,System.Uri)
Creates a new hyperlink from a Uri.

Autodesk.Navisworks.Api.Hyperlink.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.Hyperlink.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.Hyperlink.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Hyperlink.Name
Hyperlink name.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Hyperlink.ToString
Returns a  that represents the current .
Returns: A  that represents the current .

Autodesk.Navisworks.Api.Hyperlink.URL
Hyperlink URL.
Throws System.ObjectDisposedException:
Object has been Disposed